<template>
  <div>
    <dc-tree :visible="isShowTagTree"
              :curVal="curTag"
              :tempVal="tempTag"
              :dataDirt="tree.tagsDirt"
              :dataTree="tree.tagsTree"
              :headersName="['标签选择', '二级标签', '三级标签']"
              @changeHandler="tagChangeHandler"
              @sureHandler="sureTagHandler"
              @clickLeafHandler="sureTagHandler"/>
  </div>
</template>

<script>
export default {
  data () {
    return {
      isShowTagTree: true,
      curTag: '',
      tempTag: '',
      tree: {
        tagsDirt: {
          107: '程序设计入门',
          109: '简单输入输出',
          111: '字符串操作',
          112: '基础算法',
          113: '排序',
          114: '枚举',
          116: '查找',
          117: '贪心',
          118: '递归和分治',
          119: '递推',
          120: '回溯',
          121: '构造法',
          122: '模拟',
          123: '数据结构',
          124: '栈',
          125: '队列',
          126: '链表',
          127: '堆',
          128: '树',
          129: '高精度',
          130: '图论',
          131: '数学知识',
          132: '动态规划',
          133: '搜索',
          134: '图遍历',
          135: '最短路径',
          136: '最小生成树',
          137: '拓扑排序',
          138: '二分图',
          139: '网络流',
          140: '图基础',
          141: '数论',
          142: '博弈论',
          143: '线性代数',
          144: '组合数学',
          145: '离散数学',
          150: '顺序结构',
          151: '选择结构',
          152: '循环结构',
          153: '数组处理',
          154: '指针',
          155: '结构体',
          156: 'C语言基础概念',
          157: '快速幂',
          158: '简单数学',
          159: '双指针',
          160: '二分查找',
          161: '函数知识',
          162: '结构体和共用体',
          163: '教材课后习题',
          164: 'C语言程序设计（第三版）',
          165: '第一章 程序设计和C语言',
          166: '第三章 顺序结构',
          167: '第四章 选择结构',
          168: '第五章 循环结构',
          169: '第六章 数组处理',
          170: '第七章 函数设计',
          171: '第八章 指针运用',
          172: '第九章 结构体、共用体和枚举类型',
          174: '程序设计强化训练',
          175: '高级数据结构',
          176: '单调队列',
          180: 'CXY2020',
          181: 'XZ',
          182: 'PD',
          183: 'TK',
          184: 'GC',
          185: 'BC',
          186: 'MN',
          187: 'MN',
          188: 'MN',
          189: 'MN',
          190: 'MN',
          191: 'ZS',
          192: 'ZS',
          193: 'ZS',
          194: 'ZS',
          195: 'ZS'
        },
        tagsTree: {
          107: { 150: {}, 151: {}, 152: {}, 153: {}, 154: {}, 155: {}, 161: {}, 162: {} },
          109: {},
          111: {},
          112: { 113: {}, 114: {}, 116: {}, 117: {}, 118: {}, 119: {}, 120: {}, 121: {}, 122: {}, 133: {}, 157: {} },
          123: { 124: {}, 125: {}, 126: {}, 127: {}, 128: {}, 129: {} },
          130: { 134: {}, 135: {}, 136: {}, 137: {}, 138: {}, 139: {}, 140: {} },
          131: { 141: {}, 142: {}, 143: {}, 144: {}, 145: {}, 158: {} },
          132: {},
          156: {},
          163: { 164: { 165: {}, 166: {}, 167: {}, 168: {}, 169: {}, 170: {}, 171: {}, 172: {} }, 174: {} },
          175: { 176: {} }
        }
      }
    }
  },
  methods: {
    // 标签树选择改变操作处理监听
    tagChangeHandler (val) {
      this.tempTag = val
    },
    // 确定标签搜索
    sureTagHandler (val) {
      this.tempTag = val
      this.curTag = this.curTag === val ? '' : val
    }
  }
}
</script>

<style lang="scss" scoped>

</style>
